InformationRegisters/РСЕмаилСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РСЕмаилСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСЕмаилСообщения/Ext/ManagerModule.bsl
#Область Интерфейс

Процедура ЗафиксироватьСведенияПисьма(СтруктураПисьма) Экспорт

	Для каждого Контакт Из СтруктураПисьма["ПочтаПолучателя"] Цикл
	
		ЗафиксироватьСведенияПолучателя(СтруктураПисьма, Контакт);
	
	КонецЦикла;

КонецПроцедуры



#КонецОбласти

Процедура ЗафиксироватьСведенияПолучателя(СтруктураПисьма, ПочтаПолучателя)

	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.GUID = СтруктураПисьма.GUID;
	МенеджерЗаписи.Объект = СтруктураПисьма.Объект ;
	МенеджерЗаписи.ПочтаПолучателя = ПочтаПолучателя;
	МенеджерЗаписи.ПочтаОтправителя = СтруктураПисьма.ПочтаОтправителя;
	МенеджерЗаписи.ТекстПисьма = СтруктураПисьма.ТекстПисьма;
	МенеджерЗаписи.ДатаОтправки = СтруктураПисьма.ДатаОтправки;

	МенеджерЗаписи.Записать();

КонецПроцедуры
